var excel2 = [{
            'Name': '上海',
            'Code': '3',
            'City': [{
                'Name': '上海市',
                'Code': '5',
                'Dealer': [{
                    'Name': '上海腾众汽车销售服务有限公司',
                    'Code': '59'
                },
                {
                    'Name': '上海中进众旺汽车销售服务有限公司',
                    'Code': '64'
                },
                {
                    'Name': '上海铂众汽车销售服务有限公司',
                    'Code': '65'
                }]
            }]
        },
        {
            'Name': '安徽',
            'Code': '30',
            'City': [{
                'Name': '其他',
                'Code': '931',
                'Dealer': [{
                    'Name': '安徽风之星汽车股份有限公司',
                    'Code': '68'
                }]
            }]
        },
        {
            'Name': '福建',
            'Code': '31',
            'City': [{
                'Name': '厦门市',
                'Code': '75',
                'Dealer': [{
                    'Name': '厦门建发汽车有限公司',
                    'Code': '33'
                },
                {
                    'Name': '厦门盈众润宇汽车销售有限公司',
                    'Code': '36'
                }]
            },
            {
                'Name': '泉州市',
                'Code': '77',
                'Dealer': [{
                    'Name': '泉州盈众润和汽车销售有限公司',
                    'Code': '35'
                }]
            }]
        },
        {
            'Name': '甘肃',
            'Code': '32',
            'City': [{
                'Name': '兰州市',
                'Code': '97',
                'Dealer': [{
                    'Name': '兰州金河康汽车销售服务有限公司',
                    'Code': '70'
                }]
            }]
        },
        {
            'Name': '广东',
            'Code': '33',
            'City': [{
                'Name': '深圳市',
                'Code': '71',
                'Dealer': [{
                    'Name': '深圳市华熙汽车销售服务有限公司',
                    'Code': '28'
                }]
            },
            {
                'Name': '东莞市',
                'Code': '72',
                'Dealer': [{
                    'Name': '东莞宝瑞汽车销售服务有限公司',
                    'Code': '23'
                },
                {
                    'Name': '东莞华熙汽车销售服务有限公司',
                    'Code': '29'
                }]
            },
            {
                'Name': '广州市',
                'Code': '73',
                'Dealer': [{
                    'Name': '广东乘用汽车销售有限公司',
                    'Code': '30'
                },
                {
                    'Name': '广州鸿粤鸿众汽车销售服务有限公司',
                    'Code': '31'
                }]
            },
            {
                'Name': '中山市',
                'Code': '74',
                'Dealer': [{
                    'Name': '中山市德熙进口汽车销售服务有限公司',
                    'Code': '32'
                }]
            },
            {
                'Name': '汕头市',
                'Code': '112',
                'Dealer': [{
                    'Name': '汕头市众驰汽车有限公司',
                    'Code': '85'
                }]
            },
            {
                'Name': '惠州市',
                'Code': '114',
                'Dealer': [{
                    'Name': '惠州市德意进口汽车销售服务有限公司',
                    'Code': '38'
                }]
            },
            {
                'Name': '佛山市',
                'Code': '132',
                'Dealer': [{
                    'Name': '佛山正通众锐汽车销售服务有限公司',
                    'Code': '54'
                }]
            },
            {
                'Name': '珠海市',
                'Code': '215',
                'Dealer': [{
                    'Name': '珠海市华熙汽车销售服务有限公司',
                    'Code': '18'
                }]
            }]
        },
        {
            'Name': '广西',
            'Code': '34',
            'City': [{
                'Name': '南宁市',
                'Code': '79',
                'Dealer': [{
                    'Name': '广西弘德腾锐汽车销售服务有限责任公司',
                    'Code': '43'
                }]
            }]
        },
        {
            'Name': '贵州',
            'Code': '35',
            'City': [{
                'Name': '贵阳市',
                'Code': '103',
                'Dealer': [{
                    'Name': '贵州新双立汽车销售服务有限责任公司',
                    'Code': '78'
                }]
            }]
        },
        {
            'Name': '海南',
            'Code': '36',
            'City': [{
                'Name': '海口市',
                'Code': '80',
                'Dealer': [{
                    'Name': '海南华众汽车销售服务有限公司',
                    'Code': '44'
                },
                {
                    'Name': '海口嘉华永信汽车销售服务有限公司',
                    'Code': '63'
                }]
            }]
        },
        {
            'Name': '河北',
            'Code': '37',
            'City': [{
                'Name': '石家庄市',
                'Code': '67',
                'Dealer': [{
                    'Name': '河北华菱丰汽车贸易有限公司',
                    'Code': '24'
                }]
            },
            {
                'Name': '唐山市',
                'Code': '68',
                'Dealer': [{
                    'Name': '唐山众腾汽车销售有限公司',
                    'Code': '25'
                }]
            }]
        },
        {
            'Name': '河南',
            'Code': '38',
            'City': [{
                'Name': '郑州市',
                'Code': '94',
                'Dealer': [{
                    'Name': '河南中豫汽车贸易有限公司',
                    'Code': '19'
                },
                {
                    'Name': '河南国际汽车贸易有限公司',
                    'Code': '67'
                }]
            },
            {
                'Name': '洛阳市',
                'Code': '134',
                'Dealer': [{
                    'Name': '洛阳中豫汽车贸易有限公司',
                    'Code': '61'
                }]
            }]
        },
        {
            'Name': '黑龙江',
            'Code': '39',
            'City': [{
                'Name': '哈尔滨市',
                'Code': '66',
                'Dealer': [{
                    'Name': '哈尔滨大昌合众汽车销售服务有限公司',
                    'Code': '17'
                }]
            }]
        },
        {
            'Name': '湖北',
            'Code': '40',
            'City': [{
                'Name': '武汉市',
                'Code': '117',
                'Dealer': [{
                    'Name': '大众汽车（北京）中心有限公司',
                    'Code': '1'
                },
                {
                    'Name': '武汉锐腾汽车贸易服务有限公司',
                    'Code': '37'
                },
                {
                    'Name': '湖北尚腾汽车贸易有限公司',
                    'Code': '66'
                },
                {
                    'Name': '武汉友芝友谦和汽车贸易有限公司',
                    'Code': '129'
                }]
            },
            {
                'Name': '宜昌市',
                'Code': '289',
                'Dealer': [{
                    'Name': '宜昌尚腾汽车销售服务有限公司',
                    'Code': '94'
                }]
            }]
        },
        {
            'Name': '湖南',
            'Code': '41',
            'City': [{
                'Name': '长沙市',
                'Code': '78',
                'Dealer': [{
                    'Name': '湖南德顺汽车贸易有限公司',
                    'Code': '41'
                },
                {
                    'Name': '湖南德熙进口汽车销售服务有限公司',
                    'Code': '42'
                }]
            }]
        },
        {
            'Name': '吉林',
            'Code': '42',
            'City': [{
                'Name': '长春市',
                'Code': '65',
                'Dealer': [{
                    'Name': '长春大昌合众汽车销售服务有限公司',
                    'Code': '16'
                },
                {
                    'Name': '长春尚腾汽车销售服务有限公司',
                    'Code': '21'
                }]
            }]
        },
        {
            'Name': '江苏',
            'Code': '43',
            'City': [{
                'Name': '南京市',
                'Code': '87',
                'Dealer': [{
                    'Name': '南京交家电车辆有限公司',
                    'Code': '53'
                },
                {
                    'Name': '南京景众汽车销售服务有限公司',
                    'Code': '82'
                }]
            },
            {
                'Name': '苏州市',
                'Code': '88',
                'Dealer': [{
                    'Name': '苏州市金阊众翔汽车销售服务有限公司',
                    'Code': '55'
                },
                {
                    'Name': '苏州捷骏汽车贸易有限公司',
                    'Code': '89'
                }]
            },
            {
                'Name': '无锡市',
                'Code': '89',
                'Dealer': [{
                    'Name': '无锡腾众汽车销售服务有限公司',
                    'Code': '56'
                },
                {
                    'Name': '江阴中进众旺汽车销售服务有限公司 ',
                    'Code': '88'
                }]
            },
            {
                'Name': '常州市',
                'Code': '90',
                'Dealer': [{
                    'Name': '常州德立汽车销售服务有限公司',
                    'Code': '57'
                }]
            },
            {
                'Name': '南通市',
                'Code': '91',
                'Dealer': [{
                    'Name': '南通德立汽车销售服务有限公司',
                    'Code': '58'
                }]
            },
            {
                'Name': '扬州市',
                'Code': '133',
                'Dealer': [{
                    'Name': '扬州新丰泰汽车有限责任公司',
                    'Code': '62'
                }]
            }]
        },
        {
            'Name': '江西',
            'Code': '44',
            'City': [{
                'Name': '南昌市',
                'Code': '96',
                'Dealer': [{
                    'Name': '江西尚腾汽车贸易有限公司',
                    'Code': '69'
                }]
            }]
        },
        {
            'Name': '辽宁',
            'Code': '45',
            'City': [{
                'Name': '大连市',
                'Code': '60',
                'Dealer': [{
                    'Name': '大连大昌合众汽车销售服务有限公司',
                    'Code': '7'
                }]
            },
            {
                'Name': '沈阳市',
                'Code': '61',
                'Dealer': [{
                    'Name': '沈阳大昌合众汽车销售服务有限公司',
                    'Code': '8'
                },
                {
                    'Name': '辽宁川达汽车销售服务有限公司',
                    'Code': '9'
                }]
            }]
        },
        {
            'Name': '内蒙',
            'Code': '46',
            'City': [{
                'Name': '呼和浩特市',
                'Code': '69',
                'Dealer': [{
                    'Name': '内蒙古华菱丰汽车贸易有限公司',
                    'Code': '26'
                }]
            },
            {
                'Name': '鄂尔多斯市',
                'Code': '70',
                'Dealer': [{
                    'Name': '鄂尔多斯市德众鑫汽车销售有限责任公司',
                    'Code': '27'
                }]
            },
            {
                'Name': '包头市',
                'Code': '109',
                'Dealer': [{
                    'Name': '包头市华日菱汽车有限公司',
                    'Code': '60'
                },
                {
                    'Name': '包头众锐汽车销售服务有限公司',
                    'Code': '80'
                }]
            }]
        },
        {
            'Name': '宁夏',
            'Code': '47',
            'City': [{
                'Name': '银川市',
                'Code': '104',
                'Dealer': [{
                    'Name': '宁夏和众进口汽车销售服务有限公司',
                    'Code': '79'
                }]
            }]
        },
        {
            'Name': '青海',
            'Code': '48',
            'City': [{
                'Name': '西宁市',
                'Code': '119',
                'Dealer': [{
                    'Name': '青海嘉信汽车销售服务有限公司',
                    'Code': '87'
                }]
            }]
        },
        {
            'Name': '山东',
            'Code': '49',
            'City': [{
                'Name': '青岛市',
                'Code': '105',
                'Dealer': [{
                    'Name': '青岛德辉汽车销售服务有限公司',
                    'Code': '11'
                },
                {
                    'Name': '青岛百得利汽车销售服务有限公司',
                    'Code': '93'
                }]
            },
            {
                'Name': '烟台市',
                'Code': '106',
                'Dealer': [{
                    'Name': '烟台德辉汽车销售服务有限公司',
                    'Code': '12'
                }]
            },
            {
                'Name': '济南市',
                'Code': '107',
                'Dealer': [{
                    'Name': '济南德辉汽车销售服务有限公司',
                    'Code': '13'
                }]
            },
            {
                'Name': '淄博市',
                'Code': '108',
                'Dealer': [{
                    'Name': '淄博润之坤汽车销售有限公司',
                    'Code': '14'
                }]
            }]
        },
        {
            'Name': '山西',
            'Code': '50',
            'City': [{
                'Name': '太原市',
                'Code': '64',
                'Dealer': [{
                    'Name': '山西华菱丰汽车贸易有限公司',
                    'Code': '15'
                }]
            },
            {
                'Name': '大同市',
                'Code': '110',
                'Dealer': [{
                    'Name': '大同市华菱丰汽车贸易有限公司',
                    'Code': '83'
                }]
            }]
        },
        {
            'Name': '陕西',
            'Code': '51',
            'City': [{
                'Name': '西安市',
                'Code': '101',
                'Dealer': [{
                    'Name': '陕西鑫海德宇汽车销售服务有限公司',
                    'Code': '4'
                },
                {
                    'Name': '陕西新丰泰汽车技术开发有限责任公司',
                    'Code': '76'
                }]
            },
            {
                'Name': '榆林市',
                'Code': '115',
                'Dealer': [{
                    'Name': '榆林德泰汽车销售服务有限公司',
                    'Code': '39'
                }]
            }]
        },
        {
            'Name': '四川',
            'Code': '52',
            'City': [{
                'Name': '成都市',
                'Code': '98',
                'Dealer': [{
                    'Name': '四川新双立汽车销售服务有限责任公司',
                    'Code': '71'
                },
                {
                    'Name': '成都新进程汽车销售服务有限责任公司',
                    'Code': '92'
                }]
            },
            {
                'Name': '绵阳市',
                'Code': '216',
                'Dealer': [{
                    'Name': '绵阳新双立汽车销售服务有限公司',
                    'Code': '22'
                }]
            }]
        },
        {
            'Name': '天津',
            'Code': '53',
            'City': [{
                'Name': '天津市',
                'Code': '63',
                'Dealer': [{
                    'Name': '天津空港众辉汽车销售有限公司',
                    'Code': '10'
                },
                {
                    'Name': '天津市中顺联众汽车服务有限公司',
                    'Code': '81'
                }]
            }]
        },
        {
            'Name': '西藏',
            'Code': '54',
            'City': [{
                'Name': '拉萨市',
                'Code': '291',
                'Dealer': [{
                    'Name': '西藏广汇华创汽车服务有限公司',
                    'Code': '95'
                }]
            }]
        },
        {
            'Name': '新疆',
            'Code': '55',
            'City': [{
                'Name': '乌鲁木齐市',
                'Code': '102',
                'Dealer': [{
                    'Name': '新疆天汇华鑫汽车销售服务有限公司',
                    'Code': '5'
                },
                {
                    'Name': '新疆腾众汽车销售服务有限公司',
                    'Code': '77'
                }]
            }]
        },
        {
            'Name': '云南',
            'Code': '56',
            'City': [{
                'Name': '昆明市',
                'Code': '99',
                'Dealer': [{
                    'Name': '云南德众汽车销售服务有限公司',
                    'Code': '72'
                },
                {
                    'Name': '云南兴星机电贸易有限公司',
                    'Code': '73'
                }]
            }]
        },
        {
            'Name': '浙江',
            'Code': '57',
            'City': [{
                'Name': '杭州市',
                'Code': '81',
                'Dealer': [{
                    'Name': '浙江捷通汽车有限公司',
                    'Code': '45'
                },
                {
                    'Name': '浙江奥德汽车有限公司',
                    'Code': '51'
                },
                {
                    'Name': '杭州百得利汽车有限公司',
                    'Code': '52'
                },
                {
                    'Name': '杭州嘉洋汽车销售服务有限公司',
                    'Code': '90'
                }]
            },
            {
                'Name': '台州市',
                'Code': '82',
                'Dealer': [{
                    'Name': '台州旅行者汽车销售服务有限公司',
                    'Code': '46'
                }]
            },
            {
                'Name': '宁波市',
                'Code': '84',
                'Dealer': [{
                    'Name': '宁波众通汽车有限公司',
                    'Code': '48'
                },
                {
                    'Name': '宁波中进众旺汽车销售服务有限公司',
                    'Code': '49'
                }]
            },
            {
                'Name': '嘉兴市',
                'Code': '85',
                'Dealer': [{
                    'Name': '嘉兴禾众睿德汽车销售服务有限公司',
                    'Code': '50'
                }]
            },
            {
                'Name': '温州市',
                'Code': '111',
                'Dealer': [{
                    'Name': '温州中汽和鸿汽车销售服务有限公司',
                    'Code': '20'
                },
                {
                    'Name': '温州之远汽车有限公司',
                    'Code': '84'
                }]
            },
            {
                'Name': '金华市',
                'Code': '113',
                'Dealer': [{
                    'Name': '义乌恒众汽车销售服务有限公司',
                    'Code': '47'
                },
                {
                    'Name': '金华之远汽车有限公司',
                    'Code': '86'
                }]
            }]
        },
        {
            'Name': '重庆',
            'Code': '58',
            'City': [{
                'Name': '重庆市',
                'Code': '100',
                'Dealer': [{
                    'Name': '重庆百事达华尊汽车销售服务有限公司',
                    'Code': '40'
                },
                {
                    'Name': '重庆博众辉锐汽车销售有限公司',
                    'Code': '74'
                },
                {
                    'Name': '重庆百事达华轩汽车销售服务有限公司',
                    'Code': '75'
                }]
            }]
        }]