var excel2 = [{
    'Name': '北京',
    'Code': '2',
    'City': [{
        'Name': '北京市 ',
        'Code': '59',
        'Dealer': [{
            'Name': '大众汽车（北京）中心有限公司',
            'Code': '3'
        },
        {
            'Name': '北京华日菱汽车贸易有限公司',
            'Code': '4'
        },
        {
            'Name': '北京中进众旺汽车销售服务有限公司',
            'Code': '5'
        },
        {
            'Name': '北京亚之杰合众汽车销售服务有限责任公司',
            'Code': '8'
        },
        {
            'Name': '北京骏宝捷汽车维修有限公司',
            'Code': '131'
        },
        {
            'Name': '大众进口汽车尊享荟（北京）',
            'Code': '274'
        }]
    }]
},
{
    'Name': '上海 ',
    'Code': '3',
    'City': [{
        'Name': '上海',
        'Code': '5',
        'Dealer': [{
            'Name': '上海腾众汽车销售服务有限公司',
            'Code': '52'
        },
        {
            'Name': '上海中进众旺汽车销售服务有限公司',
            'Code': '53'
        },
        {
            'Name': '上海铂众汽车销售服务有限公司',
            'Code': '54'
        },
        {
            'Name': '上海佰泰汽车销售服务有限公司',
            'Code': '122'
        },
        {
            'Name': '上海正通众辉汽车销售服务有限公司',
            'Code': '136'
        },
        {
            'Name': '太古汽车销售服务（上海）有限公司',
            'Code': '146'
        },
        {
            'Name': '大众进口汽车尊享荟（上海浦东）',
            'Code': '287'
        }]
    },
    {
        'Name': '杨浦区',
        'Code': '305',
        'Dealer': [{
            'Name': '上海百联沪东汽车销售服务有限公司',
            'Code': '198'
        }]
    }]
},
{
    'Name': '山东',
    'Code': '49',
    'City': [{
        'Name': '青岛市 ',
        'Code': '105',
        'Dealer': [{
            'Name': '青岛德辉汽车销售服务有限公司',
            'Code': '13'
        },
        {
            'Name': '大众进口汽车尊享荟（青岛）',
            'Code': '285'
        }]
    },
    {
        'Name': '烟台市 ',
        'Code': '106',
        'Dealer': [{
            'Name': '烟台德辉汽车销售服务有限公司',
            'Code': '14'
        }]
    },
    {
        'Name': '济南市 ',
        'Code': '107',
        'Dealer': [{
            'Name': '济南德辉汽车销售服务有限公司',
            'Code': '15'
        },
        {
            'Name': '山东百得利汽车销售有限公司',
            'Code': '121'
        }]
    },
    {
        'Name': '淄博市 ',
        'Code': '108',
        'Dealer': [{
            'Name': '淄博润之坤汽车销售有限公司',
            'Code': '16'
        }]
    },
    {
        'Name': '临沂市',
        'Code': '304',
        'Dealer': [{
            'Name': '临沂万华汽车销售服务有限公司',
            'Code': '120'
        }]
    },
    {
        'Name': '威海市',
        'Code': '316',
        'Dealer': [{
            'Name': '威海庞大兴锐汽车销售服务有限公司',
            'Code': '135'
        }]
    },
    {
        'Name': '滨州市',
        'Code': '6128',
        'Dealer': [{
            'Name': '滨州和佳汽车销售服务有限公司',
            'Code': '160'
        }]
    },
    {
        'Name': '枣庄市',
        'Code': '6137',
        'Dealer': [{
            'Name': '枣庄鲁沪旧机动车交易有限公司',
            'Code': '171'
        }]
    },
    {
        'Name': '德州市',
        'Code': '6159',
        'Dealer': [{
            'Name': '德州众驰汽车销售服务有限公司',
            'Code': '189'
        }]
    },
    {
        'Name': '济宁市',
        'Code': '6160',
        'Dealer': [{
            'Name': '济宁交运汽车销售服务有限公司',
            'Code': '191'
        }]
    },
    {
        'Name': '聊城市',
        'Code': '6164',
        'Dealer': [{
            'Name': '聊城市五州商务汽车销售有限公司',
            'Code': '195'
        }]
    },
    {
        'Name': '东营市',
        'Code': '6165',
        'Dealer': [{
            'Name': '东营石大汽车销售服务有限公司',
            'Code': '196'
        }]
    },
    {
        'Name': '菏泽市',
        'Code': '6167',
        'Dealer': [{
            'Name': '青岛百得利汽车销售有限公司',
            'Code': '104'
        },
        {
            'Name': '菏泽众通汽车销售服务有限公司',
            'Code': '186'
        }]
    },
    {
        'Name': '潍坊市',
        'Code': '6249',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（潍坊）',
            'Code': '290'
        },
        {
            'Name': '潍坊百得利贸易有限公司',
            'Code': '330'
        }]
    },
    {
        'Name': '泰安市',
        'Code': '6250',
        'Dealer': [{
            'Name': '泰安新德辉汽车销售服务有限公司',
            'Code': '326'
        }]
    }]
},
{
    'Name': '山西',
    'Code': '50',
    'City': [{
        'Name': '太原市 ',
        'Code': '64',
        'Dealer': [{
            'Name': '山西华菱丰汽车贸易有限公司',
            'Code': '17'
        },
        {
            'Name': '大众进口汽车尊享荟（太原）',
            'Code': '289'
        }]
    },
    {
        'Name': '大同市 ',
        'Code': '110',
        'Dealer': [{
            'Name': '大同市华菱丰汽车贸易有限公司',
            'Code': '74'
        }]
    },
    {
        'Name': '临汾市',
        'Code': '6123',
        'Dealer': [{
            'Name': '临汾市新盛红龙汽车连锁销售有限公司',
            'Code': '341'
        }]
    },
    {
        'Name': '长治市',
        'Code': '6124',
        'Dealer': [{
            'Name': '长治市众众汽车销售服务有限公司',
            'Code': '156'
        }]
    },
    {
        'Name': '晋中市',
        'Code': '6133',
        'Dealer': [{
            'Name': '晋中华润汽车贸易有限公司',
            'Code': '166'
        }]
    },
    {
        'Name': '运城市',
        'Code': '6134',
        'Dealer': [{
            'Name': '运城市彩虹申联汽车销售服务有限公司',
            'Code': '168'
        }]
    },
    {
        'Name': '朔州市',
        'Code': '6143',
        'Dealer': [{
            'Name': '朔州宏志汽车销售服务有限公司',
            'Code': '178'
        }]
    },
    {
        'Name': '吕梁市',
        'Code': '6144',
        'Dealer': [{
            'Name': '吕梁庞大兴锐汽车销售服务有限公司',
            'Code': '179'
        }]
    },
    {
        'Name': '晋城市',
        'Code': '6198',
        'Dealer': [{
            'Name': '晋城煤销汽车销售服务有限公司',
            'Code': '219'
        }]
    },
    {
        'Name': '忻州市',
        'Code': '6251',
        'Dealer': [{
            'Name': '忻州市永明汽车销售服务有限公司',
            'Code': '332'
        }]
    },
    {
        'Name': '阳泉市',
        'Code': '6252',
        'Dealer': [{
            'Name': '山西众晟达汽车贸易有限公司',
            'Code': '321'
        }]
    }]
},
{
    'Name': '陕西',
    'Code': '51',
    'City': [{
        'Name': '西安市 ',
        'Code': '101',
        'Dealer': [{
            'Name': '陕西新丰泰汽车技术开发有限责任公司',
            'Code': '66'
        },
        {
            'Name': '陕西馨海德宇汽车销售服务有限公司',
            'Code': '94'
        }]
    },
    {
        'Name': '榆林市 ',
        'Code': '115',
        'Dealer': [{
            'Name': '榆林德泰汽车销售服务有限公司',
            'Code': '87'
        },
        {
            'Name': '榆林市东洲兴达汽车销售服务有限公司',
            'Code': '175'
        }]
    },
    {
        'Name': '宝鸡市',
        'Code': '6138',
        'Dealer': [{
            'Name': '宝鸡众信天博汽车销售服务有限公司',
            'Code': '172'
        }]
    },
    {
        'Name': '咸阳市',
        'Code': '6157',
        'Dealer': [{
            'Name': '陕西众秦汽车销售服务有限公司',
            'Code': '184'
        }]
    },
    {
        'Name': '延安市',
        'Code': '6202',
        'Dealer': [{
            'Name': '延安祥盛汽车销售服务有限公司',
            'Code': '252'
        }]
    },
    {
        'Name': '汉中市',
        'Code': '6253',
        'Dealer': [{
            'Name': '汉中嘉恒汽车贸易有限公司',
            'Code': '307'
        }]
    },
    {
        'Name': '渭南市',
        'Code': '6254',
        'Dealer': [{
            'Name': '渭南燕兴汽车销售服务有限公司',
            'Code': '331'
        }]
    }]
},
{
    'Name': '四川',
    'Code': '52',
    'City': [{
        'Name': '成都市 ',
        'Code': '98',
        'Dealer': [{
            'Name': '四川新双立汽车销售服务有限责任公司',
            'Code': '60'
        },
        {
            'Name': '成都新进程汽车销售服务有限责任公司',
            'Code': '105'
        },
        {
            'Name': '成都新鸿众汽车销售服务有限责任公司',
            'Code': '129'
        }]
    },
    {
        'Name': '绵阳市',
        'Code': '202',
        'Dealer': [{
            'Name': '绵阳新双立汽车销售服务有限公司',
            'Code': '98'
        }]
    },
    {
        'Name': '宜宾市',
        'Code': '337',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（宜宾）',
            'Code': '294'
        }]
    },
    {
        'Name': '德阳市',
        'Code': '338',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（德阳）',
            'Code': '276'
        }]
    },
    {
        'Name': '泸州市',
        'Code': '6255',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（泸州）',
            'Code': '282'
        }]
    }]
},
{
    'Name': '天津',
    'Code': '53',
    'City': [{
        'Name': '天津市 ',
        'Code': '63',
        'Dealer': [{
            'Name': '天津空港众辉汽车销售有限公司',
            'Code': '12'
        },
        {
            'Name': '天津市中顺联众汽车服务有限公司',
            'Code': '71'
        }]
    }]
},
{
    'Name': '西藏',
    'Code': '54',
    'City': [{
        'Name': '拉萨市',
        'Code': '265',
        'Dealer': [{
            'Name': '西藏广汇华创汽车服务有限公司',
            'Code': '107'
        }]
    }]
},
{
    'Name': '新疆',
    'Code': '55',
    'City': [{
        'Name': '乌鲁木齐市 ',
        'Code': '102',
        'Dealer': [{
            'Name': '新疆腾众汽车销售服务有限公司',
            'Code': '67'
        },
        {
            'Name': '新疆天汇华鑫汽车销售服务有限公司',
            'Code': '95'
        },
        {
            'Name': '大众进口汽车尊享荟（乌鲁木齐）',
            'Code': '291'
        }]
    },
    {
        'Name': '伊犁哈萨克自治州',
        'Code': '6203',
        'Dealer': [{
            'Name': '伊犁申博汽车销售服务有限公司',
            'Code': '254'
        }]
    },
    {
        'Name': '昌吉回族自治州',
        'Code': '6256',
        'Dealer': [{
            'Name': '新疆昌吉正太汽车销售有限公司',
            'Code': '333'
        }]
    },
    {
        'Name': '巴音郭楞蒙古自治州',
        'Code': '6257',
        'Dealer': [{
            'Name': '新疆上众汽车销售服务有限公司',
            'Code': '334'
        }]
    }]
},
{
    'Name': '云南',
    'Code': '56',
    'City': [{
        'Name': '昆明市 ',
        'Code': '99',
        'Dealer': [{
            'Name': '云南德众汽车销售服务有限公司',
            'Code': '62'
        },
        {
            'Name': '云南兴星机电贸易有限公司',
            'Code': '63'
        },
        {
            'Name': '大众进口汽车尊享荟（昆明）',
            'Code': '281'
        },
        {
            'Name': '云南德众汽车销售服务有限公司北市区分公司',
            'Code': '336'
        }]
    },
    {
        'Name': '曲靖市',
        'Code': '306',
        'Dealer': [{
            'Name': '曲靖庞大弘锐汽车销售服务有限公司',
            'Code': '123'
        }]
    },
    {
        'Name': '红河哈尼族彝族自治州',
        'Code': '6204',
        'Dealer': [{
            'Name': '红河州天鸿汽车经贸有限公司',
            'Code': '258'
        }]
    },
    {
        'Name': '玉溪市',
        'Code': '6205',
        'Dealer': [{
            'Name': '玉溪金恒汽车销售服务有限公司',
            'Code': '259'
        }]
    },
    {
        'Name': '普洱市',
        'Code': '6258',
        'Dealer': [{
            'Name': '普洱鸿达博众汽车销售有限公司',
            'Code': '319'
        }]
    },
    {
        'Name': '大理',
        'Code': '6259',
        'Dealer': [{
            'Name': '云南德众汽车销售服务有限公司大理分公司',
            'Code': '337'
        }]
    }]
},
{
    'Name': '浙江',
    'Code': '57',
    'City': [{
        'Name': '杭州市 ',
        'Code': '81',
        'Dealer': [{
            'Name': '浙江捷通汽车有限公司',
            'Code': '38'
        },
        {
            'Name': '杭州百得利汽车有限公司',
            'Code': '45'
        },
        {
            'Name': '杭州嘉洋汽车销售服务有限公司',
            'Code': '103'
        },
        {
            'Name': '浙江元通捷通汽车有限公司',
            'Code': '130'
        }]
    },
    {
        'Name': '台州市 ',
        'Code': '82',
        'Dealer': [{
            'Name': '台州旅行者汽车销售服务有限公司',
            'Code': '39'
        },
        {
            'Name': '台州德业汽车有限公司',
            'Code': '124'
        }]
    },
    {
        'Name': '义乌市 ',
        'Code': '83',
        'Dealer': [{
            'Name': '义乌恒众汽车销售服务有限公司',
            'Code': '40'
        }]
    },
    {
        'Name': '宁波市 ',
        'Code': '84',
        'Dealer': [{
            'Name': '宁波众通汽车有限公司',
            'Code': '41'
        },
        {
            'Name': '宁波中进众旺汽车销售服务有限公司',
            'Code': '42'
        }]
    },
    {
        'Name': '嘉兴市 ',
        'Code': '85',
        'Dealer': [{
            'Name': '嘉兴禾众睿德汽车销售服务有限公司',
            'Code': '43'
        }]
    },
    {
        'Name': '绍兴市 ',
        'Code': '86',
        'Dealer': [{
            'Name': '浙江奥德汽车有限公司',
            'Code': '44'
        }]
    },
    {
        'Name': '温州市 ',
        'Code': '111',
        'Dealer': [{
            'Name': '温州之远汽车有限公司',
            'Code': '75'
        },
        {
            'Name': '温州中汽和鸿汽车销售服务有限公司',
            'Code': '97'
        }]
    },
    {
        'Name': '金华市 ',
        'Code': '113',
        'Dealer': [{
            'Name': '金华之远汽车有限公司',
            'Code': '77'
        },
        {
            'Name': '金华申浙汽车有限公司',
            'Code': '162'
        }]
    },
    {
        'Name': '慈溪市',
        'Code': '307',
        'Dealer': [{
            'Name': '慈溪康桥海之众汽车销售服务有限公司',
            'Code': '125'
        }]
    },
    {
        'Name': '湖州市',
        'Code': '308',
        'Dealer': [{
            'Name': '湖州禾众誉德汽车销售服务有限公司',
            'Code': '127'
        }]
    },
    {
        'Name': '丽水市',
        'Code': '6119',
        'Dealer': [{
            'Name': '丽水市德众汽车销售服务有限公司',
            'Code': '151'
        }]
    },
    {
        'Name': '衢州市',
        'Code': '6140',
        'Dealer': [{
            'Name': '浙江中通汽车销售服务有限公司',
            'Code': '174'
        }]
    },
    {
        'Name': '台州市',
        'Code': '6199',
        'Dealer': [{
            'Name': '台州申浙汽车销售服务有限公司',
            'Code': '188'
        }]
    }]
},
{
    'Name': '重庆',
    'Code': '58',
    'City': [{
        'Name': '重庆市 ',
        'Code': '100',
        'Dealer': [{
            'Name': '重庆博众辉锐汽车销售有限公司',
            'Code': '64'
        },
        {
            'Name': '重庆百事达华轩汽车销售服务有限公司',
            'Code': '65'
        }]
    },
    {
        'Name': '万州区',
        'Code': '135',
        'Dealer': [{
            'Name': '重庆百事达华尊汽车销售服务有限公司',
            'Code': '88'
        }]
    }]
},
{
    'Name': '安徽',
    'Code': '30',
    'City': [{
        'Name': '合肥市 ',
        'Code': '95',
        'Dealer': [{
            'Name': '安徽上联汽车销售服务有限公司',
            'Code': '147'
        }]
    },
    {
        'Name': '芜湖市',
        'Code': '298',
        'Dealer': [{
            'Name': '安徽风之星汽车股份有限公司',
            'Code': '57'
        },
        {
            'Name': '芜湖风之星汽车服务有限公司',
            'Code': '108'
        },
        {
            'Name': '芜湖众爱汽车销售服务有限公司',
            'Code': '190'
        }]
    },
    {
        'Name': '马鞍山市',
        'Code': '6141',
        'Dealer': [{
            'Name': '马鞍山市中大申众汽车销售服务有限公司',
            'Code': '176'
        }]
    },
    {
        'Name': '宣城市',
        'Code': '6142',
        'Dealer': [{
            'Name': '宣城亚众汽车销售服务有限公司',
            'Code': '177'
        }]
    },
    {
        'Name': '安庆市',
        'Code': '6200',
        'Dealer': [{
            'Name': '安庆永兴汽车销售服务有限公司',
            'Code': '234'
        }]
    },
    {
        'Name': '六安市',
        'Code': '6201',
        'Dealer': [{
            'Name': '上海大众汽车六安销售服务有限公司',
            'Code': '236'
        }]
    },
    {
        'Name': '淮南市',
        'Code': '6232',
        'Dealer': [{
            'Name': '淮南鑫众汽车销售有限公司',
            'Code': '309'
        }]
    },
    {
        'Name': '铜陵市',
        'Code': '6233',
        'Dealer': [{
            'Name': '铜陵市众顺汽车销售服务有限公司',
            'Code': '329'
        }]
    }]
},
{
    'Name': '福建',
    'Code': '31',
    'City': [{
        'Name': '厦门市 ',
        'Code': '75',
        'Dealer': [{
            'Name': '厦门建发汽车有限公司',
            'Code': '30'
        },
        {
            'Name': '厦门盈众润宇汽车销售有限公司',
            'Code': '33'
        },
        {
            'Name': '大众进口汽车尊享荟（厦门）',
            'Code': '286'
        }]
    },
    {
        'Name': '福州市 ',
        'Code': '76',
        'Dealer': [{
            'Name': '福建盈众润达汽车销售有限公司',
            'Code': '31'
        },
        {
            'Name': '福州大有铜众汽车维修服务站',
            'Code': '197'
        },
        {
            'Name': '太古汽车销售服务（福州）有限公司',
            'Code': '325'
        }]
    },
    {
        'Name': '泉州市 ',
        'Code': '77',
        'Dealer': [{
            'Name': '泉州盈众润和汽车销售有限公司',
            'Code': '32'
        },
        {
            'Name': '泉州众骋汽车有限公司',
            'Code': '320'
        }]
    },
    {
        'Name': '漳州市',
        'Code': '6132',
        'Dealer': [{
            'Name': '漳州致和汽车有限公司',
            'Code': '167'
        }]
    },
    {
        'Name': '莆田市',
        'Code': '6154',
        'Dealer': [{
            'Name': '莆田市荣泰汽车服务有限公司',
            'Code': '181'
        }]
    },
    {
        'Name': '宁德市',
        'Code': '6234',
        'Dealer': [{
            'Name': '福建合众汽车有限公司',
            'Code': '301'
        }]
    },
    {
        'Name': '三明市',
        'Code': '6235',
        'Dealer': [{
            'Name': '福建三明市原林汽车销售服务有限公司',
            'Code': '302'
        }]
    },
    {
        'Name': '南平市',
        'Code': '6236',
        'Dealer': [{
            'Name': '福建省建瓯市闽众汽车有限公司',
            'Code': '303'
        }]
    }]
},
{
    'Name': '甘肃',
    'Code': '32',
    'City': [{
        'Name': '兰州市 ',
        'Code': '97',
        'Dealer': [{
            'Name': '兰州金河康汽车销售服务有限公司',
            'Code': '59'
        }]
    }]
},
{
    'Name': '广东',
    'Code': '33',
    'City': [{
        'Name': '深圳市 ',
        'Code': '71',
        'Dealer': [{
            'Name': '深圳市华熙汽车销售服务有限公司',
            'Code': '24'
        },
        {
            'Name': '深圳市德鹏进口汽车销售有限公司',
            'Code': '110'
        },
        {
            'Name': '深圳市德熙汽车销售有限公司',
            'Code': '192'
        },
        {
            'Name': '大众进口汽车尊享荟（深圳）',
            'Code': '288'
        }]
    },
    {
        'Name': '东莞市 ',
        'Code': '72',
        'Dealer': [{
            'Name': '东莞华熙汽车销售服务有限公司',
            'Code': '26'
        },
        {
            'Name': '东莞宝瑞汽车销售服务有限公司',
            'Code': '99'
        },
        {
            'Name': '大众进口汽车尊享荟（东莞）',
            'Code': '277'
        }]
    },
    {
        'Name': '广州市 ',
        'Code': '73',
        'Dealer': [{
            'Name': '广东乘用汽车销售有限公司',
            'Code': '27'
        },
        {
            'Name': '广州鸿粤鸿众汽车销售服务有限公司',
            'Code': '28'
        },
        {
            'Name': '大众进口汽车尊享荟（广州）',
            'Code': '278'
        }]
    },
    {
        'Name': '中山市 ',
        'Code': '74',
        'Dealer': [{
            'Name': '中山市德熙进口汽车销售服务有限公司',
            'Code': '29'
        }]
    },
    {
        'Name': '汕头市 ',
        'Code': '112',
        'Dealer': [{
            'Name': '汕头市众驰汽车有限公司',
            'Code': '76'
        }]
    },
    {
        'Name': '惠州市 ',
        'Code': '114',
        'Dealer': [{
            'Name': '惠州市德意进口汽车销售服务有限公司',
            'Code': '86'
        }]
    },
    {
        'Name': '佛山市 ',
        'Code': '132',
        'Dealer': [{
            'Name': '佛山正通众锐汽车销售服务有限公司',
            'Code': '92'
        }]
    },
    {
        'Name': '珠海市',
        'Code': '201',
        'Dealer': [{
            'Name': '珠海市华熙汽车销售服务有限公司',
            'Code': '96'
        },
        {
            'Name': '深圳立众汽车销售服务有限公司',
            'Code': '111'
        }]
    }]
},
{
    'Name': '广西',
    'Code': '34',
    'City': [{
        'Name': '南宁市 ',
        'Code': '79',
        'Dealer': [{
            'Name': '广西弘德腾锐汽车销售服务有限责任公司',
            'Code': '36'
        },
        {
            'Name': '广西建汇汽车销售服务有限公司',
            'Code': '173'
        }]
    },
    {
        'Name': '桂林市',
        'Code': '6155',
        'Dealer': [{
            'Name': '桂林鑫广达博远汽车销售服务有限公司',
            'Code': '182'
        }]
    },
    {
        'Name': '柳州市',
        'Code': '6166',
        'Dealer': [{
            'Name': '柳州建润汽车销售服务有限公司',
            'Code': '185'
        }]
    },
    {
        'Name': '北海市',
        'Code': '6237',
        'Dealer': [{
            'Name': '北海建润汽车销售服务有限公司',
            'Code': '271'
        }]
    }]
},
{
    'Name': '贵州',
    'Code': '35',
    'City': [{
        'Name': '贵阳市 ',
        'Code': '103',
        'Dealer': [{
            'Name': '贵州新双立汽车销售服务有限责任公司',
            'Code': '68'
        },
        {
            'Name': '大众进口汽车尊享荟（贵阳）',
            'Code': '279'
        }]
    }]
},
{
    'Name': '海南',
    'Code': '36',
    'City': [{
        'Name': '海口市 ',
        'Code': '80',
        'Dealer': [{
            'Name': '海南华众汽车销售服务有限公司',
            'Code': '37'
        },
        {
            'Name': '海口嘉华永信汽车销售服务有限公司',
            'Code': '93'
        }]
    }]
},
{
    'Name': '河北',
    'Code': '37',
    'City': [{
        'Name': '石家庄市 ',
        'Code': '67',
        'Dealer': [{
            'Name': '河北华菱丰汽车贸易有限公司',
            'Code': '20'
        },
        {
            'Name': '大众进口汽车尊享荟（石家庄）',
            'Code': '347'
        }]
    },
    {
        'Name': '唐山市 ',
        'Code': '68',
        'Dealer': [{
            'Name': '唐山众腾汽车销售有限公司',
            'Code': '21'
        },
        {
            'Name': '唐山庞大兴锐汽车销售服务有限公司',
            'Code': '133'
        }]
    },
    {
        'Name': '保定市',
        'Code': '315',
        'Dealer': [{
            'Name': '保定庞大兴锐汽车销售服务有限公司',
            'Code': '132'
        }]
    },
    {
        'Name': '廊坊市',
        'Code': '6117',
        'Dealer': [{
            'Name': '廊坊市盛德基业汽车销售服务有限公司',
            'Code': '149'
        }]
    },
    {
        'Name': '秦皇岛市',
        'Code': '6118',
        'Dealer': [{
            'Name': '秦皇岛四联通合汽车销售服务有限公司',
            'Code': '150'
        }]
    },
    {
        'Name': '沧州市',
        'Code': '6130',
        'Dealer': [{
            'Name': '沧州兴华汽车销售服务有限公司',
            'Code': '164'
        }]
    },
    {
        'Name': '张家口市',
        'Code': '6131',
        'Dealer': [{
            'Name': '张家口海达汽车销售服务有限公司',
            'Code': '165'
        }]
    },
    {
        'Name': '衡水市',
        'Code': '6161',
        'Dealer': [{
            'Name': '衡水众昌汽车销售服务有限责任公司',
            'Code': '193'
        }]
    },
    {
        'Name': '邢台市',
        'Code': '6162',
        'Dealer': [{
            'Name': '邢台盛华汽车贸易有限责任公司',
            'Code': '194'
        },
        {
            'Name': '邯郸市庞大兴锐汽车销售服务有限公司',
            'Code': '306'
        }]
    },
    {
        'Name': '承德市',
        'Code': '6195',
        'Dealer': [{
            'Name': '承德市通程汽车销售有限公司',
            'Code': '211'
        }]
    }]
},
{
    'Name': '河南',
    'Code': '38',
    'City': [{
        'Name': '郑州市 ',
        'Code': '94',
        'Dealer': [{
            'Name': '河南国际汽车贸易有限公司',
            'Code': '56'
        },
        {
            'Name': '河南中豫汽车贸易有限公司',
            'Code': '82'
        },
        {
            'Name': '大众进口汽车尊享荟（郑州）',
            'Code': '297'
        }]
    },
    {
        'Name': '洛阳市 ',
        'Code': '133',
        'Dealer': [{
            'Name': '洛阳中豫汽车贸易有限公司',
            'Code': '90'
        },
        {
            'Name': '大众进口汽车尊享荟（洛阳）',
            'Code': '283'
        }]
    }]
},
{
    'Name': '黑龙江',
    'Code': '39',
    'City': [{
        'Name': '哈尔滨市 ',
        'Code': '66',
        'Dealer': [{
            'Name': '哈尔滨大昌合众汽车销售服务有限公司',
            'Code': '19'
        },
        {
            'Name': '哈尔滨尚腾汽车销售服务有限公司',
            'Code': '305'
        }]
    },
    {
        'Name': '大庆市',
        'Code': '6120',
        'Dealer': [{
            'Name': '大庆众瑞盛汽车销售服务有限公司',
            'Code': '152'
        }]
    },
    {
        'Name': '齐齐哈尔市',
        'Code': '6188',
        'Dealer': [{
            'Name': '齐齐哈尔市中驰汽车销售服务有限公司',
            'Code': '200'
        }]
    },
    {
        'Name': '绥化市',
        'Code': '6189',
        'Dealer': [{
            'Name': '绥化勤华汽车销售服务有限公司',
            'Code': '201'
        }]
    },
    {
        'Name': '牡丹江市',
        'Code': '6240',
        'Dealer': [{
            'Name': '牡丹江通达汽车销售服务有限公司',
            'Code': '318'
        }]
    }]
},
{
    'Name': '湖北',
    'Code': '40',
    'City': [{
        'Name': '武汉市 ',
        'Code': '117',
        'Dealer': [{
            'Name': '湖北尚腾汽车贸易有限公司',
            'Code': '55'
        },
        {
            'Name': '武汉锐腾汽车贸易服务有限公司',
            'Code': '85'
        },
        {
            'Name': '武汉友芝友谦和汽车贸易有限公司',
            'Code': '148'
        }]
    },
    {
        'Name': '宜昌市',
        'Code': '260',
        'Dealer': [{
            'Name': '宜昌弘顺汽车销售服务有限公司',
            'Code': '163'
        }]
    },
    {
        'Name': '襄阳市',
        'Code': '6121',
        'Dealer': [{
            'Name': '襄阳中瑞达汽车销售有限公司',
            'Code': '153'
        }]
    },
    {
        'Name': '荆门市',
        'Code': '6206',
        'Dealer': [{
            'Name': '荆门中辰太众汽车销售服务有限公司',
            'Code': '260'
        }]
    },
    {
        'Name': '荆州市',
        'Code': '6207',
        'Dealer': [{
            'Name': '荆州市三环万通汽车有限公司',
            'Code': '261'
        }]
    },
    {
        'Name': '十堰市',
        'Code': '6208',
        'Dealer': [{
            'Name': '十堰龙基德众汽车销售服务有限公司',
            'Code': '262'
        }]
    },
    {
        'Name': '宜春市',
        'Code': '6209',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（武汉）-湖北尚腾汽车贸易有限公司',
            'Code': '293'
        }]
    }]
},
{
    'Name': '湖南',
    'Code': '41',
    'City': [{
        'Name': '长沙市 ',
        'Code': '78',
        'Dealer': [{
            'Name': '湖南德顺汽车贸易有限公司',
            'Code': '34'
        },
        {
            'Name': '湖南德熙进口汽车销售服务有限公司',
            'Code': '35'
        },
        {
            'Name': '大众进口汽车尊享荟（长沙）',
            'Code': '296'
        }]
    },
    {
        'Name': '株洲市',
        'Code': '6241',
        'Dealer': [{
            'Name': '株洲德顺汽车贸易有限公司',
            'Code': '338'
        }]
    }]
},
{
    'Name': '吉林',
    'Code': '42',
    'City': [{
        'Name': '长春市 ',
        'Code': '65',
        'Dealer': [{
            'Name': '长春大昌合众汽车销售服务有限公司',
            'Code': '18'
        },
        {
            'Name': '长春尚腾汽车销售服务有限公司',
            'Code': '84'
        }]
    },
    {
        'Name': '吉林市',
        'Code': '6122',
        'Dealer': [{
            'Name': '吉林瑞孚汽车集团有限公司',
            'Code': '154'
        }]
    },
    {
        'Name': '延边朝鲜族自治州',
        'Code': '6242',
        'Dealer': [{
            'Name': '延吉瑞鹏汽车销售服务有限公司',
            'Code': '335'
        }]
    }]
},
{
    'Name': '江苏',
    'Code': '43',
    'City': [{
        'Name': '南京市 ',
        'Code': '87',
        'Dealer': [{
            'Name': '南京交家电车辆有限公司',
            'Code': '46'
        },
        {
            'Name': '南京景众汽车销售服务有限公司',
            'Code': '72'
        },
        {
            'Name': '南京百得利汽车销售有限公司',
            'Code': '180'
        }]
    },
    {
        'Name': '苏州市 ',
        'Code': '88',
        'Dealer': [{
            'Name': '苏州市金阊众翔汽车销售服务有限公司',
            'Code': '48'
        },
        {
            'Name': '苏州捷骏汽车贸易有限公司',
            'Code': '102'
        },
        {
            'Name': '苏州新丰泰汽车销售服务有限公司',
            'Code': '115'
        }]
    },
    {
        'Name': '无锡市 ',
        'Code': '89',
        'Dealer': [{
            'Name': '无锡腾众汽车销售服务有限公司(青祁路店)',
            'Code': '49'
        },
        {
            'Name': '江阴中进众旺汽车销售服务有限公司',
            'Code': '101'
        },
        {
            'Name': '无锡金阊众翔汽车销售服务有限公司',
            'Code': '113'
        },
        {
            'Name': '大众进口汽车尊享荟（无锡）',
            'Code': '292'
        },
        {
            'Name': '无锡腾众汽车销售服务有限公司(胡埭店)',
            'Code': '346'
        }]
    },
    {
        'Name': '常州市 ',
        'Code': '90',
        'Dealer': [{
            'Name': '常州德立汽车销售服务有限公司',
            'Code': '50'
        },
        {
            'Name': '大众进口汽车尊享荟（常州）',
            'Code': '275'
        }]
    },
    {
        'Name': '南通市 ',
        'Code': '91',
        'Dealer': [{
            'Name': '南通德立汽车销售服务有限公司',
            'Code': '51'
        }]
    },
    {
        'Name': '扬州市 ',
        'Code': '134',
        'Dealer': [{
            'Name': '扬州新丰泰汽车有限责任公司',
            'Code': '91'
        }]
    },
    {
        'Name': '徐州市',
        'Code': '300',
        'Dealer': [{
            'Name': '徐州润腾汽车销售服务有限公司',
            'Code': '112'
        }]
    },
    {
        'Name': '泰州市',
        'Code': '301',
        'Dealer': [{
            'Name': '泰州德立汽车销售服务有限公司',
            'Code': '114'
        }]
    },
    {
        'Name': '镇江市',
        'Code': '317',
        'Dealer': [{
            'Name': '镇江德立汽车销售服务有限公司',
            'Code': '134'
        }]
    },
    {
        'Name': '淮安市',
        'Code': '6125',
        'Dealer': [{
            'Name': '淮安市宏宇驰众汽车销售服务有限公司',
            'Code': '157'
        }]
    },
    {
        'Name': '宿迁市',
        'Code': '6126',
        'Dealer': [{
            'Name': '宿迁上众腾盛汽车销售服务有限公司',
            'Code': '158'
        }]
    },
    {
        'Name': '连云港市',
        'Code': '6135',
        'Dealer': [{
            'Name': '连云港市和众汽车销售服务有限公司',
            'Code': '169'
        }]
    },
    {
        'Name': '盐城市',
        'Code': '6243',
        'Dealer': [{
            'Name': '江苏森风善德汽车有限公司',
            'Code': '316'
        }]
    }]
},
{
    'Name': '江西',
    'Code': '44',
    'City': [{
        'Name': '南昌市 ',
        'Code': '96',
        'Dealer': [{
            'Name': '江西尚腾汽车贸易有限公司',
            'Code': '58'
        }]
    },
    {
        'Name': '九江市',
        'Code': '6129',
        'Dealer': [{
            'Name': '九江德众汽车销售服务中心',
            'Code': '161'
        }]
    },
    {
        'Name': '上饶市',
        'Code': '6156',
        'Dealer': [{
            'Name': '上饶市天恒汽车有限公司',
            'Code': '183'
        }]
    },
    {
        'Name': '赣州市',
        'Code': '6158',
        'Dealer': [{
            'Name': '赣州奔利汽车销售服务有限公司',
            'Code': '187'
        },
        {
            'Name': '大众进口汽车尊享荟（南昌）-江西驰腾汽车贸易服务有限公司',
            'Code': '284'
        }]
    },
    {
        'Name': '宜春市',
        'Code': '6209',
        'Dealer': [{
            'Name': '宜春市新亿汽车销售服务有限公司',
            'Code': '269'
        }]
    }]
},
{
    'Name': '辽宁',
    'Code': '45',
    'City': [{
        'Name': '大连市 ',
        'Code': '60',
        'Dealer': [{
            'Name': '大连大昌合众汽车销售服务有限公司',
            'Code': '9'
        },
        {
            'Name': '大连利众汽车销售服务有限公司',
            'Code': '116'
        }]
    },
    {
        'Name': '沈阳市 ',
        'Code': '61',
        'Dealer': [{
            'Name': '沈阳大昌合众汽车销售服务有限公司',
            'Code': '10'
        },
        {
            'Name': '辽宁川达汽车销售服务有限公司',
            'Code': '11'
        },
        {
            'Name': '沈阳尚腾汽车销售服务有限公司',
            'Code': '323'
        }]
    },
    {
        'Name': '营口市',
        'Code': '302',
        'Dealer': [{
            'Name': '营口庞大兴锐汽车销售服务有限公司',
            'Code': '345'
        }]
    },
    {
        'Name': '鞍山市',
        'Code': '6127',
        'Dealer': [{
            'Name': '鞍山市牧欧汽车销售服务有限公司',
            'Code': '159'
        }]
    },
    {
        'Name': '盘锦市',
        'Code': '6136',
        'Dealer': [{
            'Name': '盘锦众成汽车销售服务有限公司',
            'Code': '170'
        }]
    },
    {
        'Name': '本溪市',
        'Code': '6190',
        'Dealer': [{
            'Name': '本溪圣隆汽车销售服务有限公司',
            'Code': '204'
        }]
    },
    {
        'Name': '朝阳市',
        'Code': '6191',
        'Dealer': [{
            'Name': '朝阳川达捷众汽车销售服务有限公司',
            'Code': '205'
        }]
    },
    {
        'Name': '抚顺市',
        'Code': '6192',
        'Dealer': [{
            'Name': '抚顺上辽汽车销售服务有限公司',
            'Code': '206'
        }]
    },
    {
        'Name': '葫芦岛市',
        'Code': '6193',
        'Dealer': [{
            'Name': '葫芦岛市川达汽车销售有限公司',
            'Code': '207'
        }]
    },
    {
        'Name': '辽阳市',
        'Code': '6194',
        'Dealer': [{
            'Name': '辽阳昕兴汽车销售服务有限公司',
            'Code': '208'
        }]
    },
    {
        'Name': '丹东市',
        'Code': '6245',
        'Dealer': [{
            'Name': '大众进口汽车尊享荟（大连）',
            'Code': '272'
        },
        {
            'Name': '丹东曙光新锦华汽车销售服务有限公司',
            'Code': '298'
        }]
    },
    {
        'Name': '锦州市',
        'Code': '6246',
        'Dealer': [{
            'Name': '辽宁中天汽车销售服务有限公司',
            'Code': '317'
        }]
    },
    {
        'Name': '铁岭市',
        'Code': '6247',
        'Dealer': [{
            'Name': '铁岭豹通汽车销售服务有限公司',
            'Code': '327'
        }]
    }]
},
{
    'Name': '内蒙 ',
    'Code': '46',
    'City': [{
        'Name': '呼和浩特市 ',
        'Code': '69',
        'Dealer': [{
            'Name': '内蒙古华菱丰汽车贸易有限公司',
            'Code': '22'
        },
        {
            'Name': '大众进口汽车尊享荟（呼和浩特）',
            'Code': '280'
        }]
    },
    {
        'Name': '鄂尔多斯市 ',
        'Code': '70',
        'Dealer': [{
            'Name': '鄂尔多斯市德众鑫汽车销售有限责任公司',
            'Code': '23'
        },
        {
            'Name': '鄂尔多斯市华菱丰汽车贸易有限责任公司',
            'Code': '300'
        },
        {
            'Name': '鄂尔多斯市华菱丰汽车贸易有限责任公司东胜区分公司',
            'Code': '339'
        }]
    },
    {
        'Name': '包头市 ',
        'Code': '109',
        'Dealer': [{
            'Name': '包头众锐汽车销售服务有限公司',
            'Code': '70'
        },
        {
            'Name': '包头市华日菱汽车有限公司',
            'Code': '89'
        },
        {
            'Name': '大众进口汽车尊享荟（包头）',
            'Code': '273'
        }]
    },
    {
        'Name': '赤峰市',
        'Code': '303',
        'Dealer': [{
            'Name': '赤峰庞大兴锐汽车销售服务有限公司',
            'Code': '118'
        }]
    },
    {
        'Name': '巴彦淖尔市',
        'Code': '6196',
        'Dealer': [{
            'Name': '巴彦淖尔市金海汽车销售服务有限公司',
            'Code': '217'
        }]
    },
    {
        'Name': '呼伦贝尔市',
        'Code': '6197',
        'Dealer': [{
            'Name': '呼伦贝尔冀海汽车贸易有限公司',
            'Code': '218'
        }]
    },
    {
        'Name': '通辽市',
        'Code': '6248',
        'Dealer': [{
            'Name': '通辽市蒙伟小汽车销售服务有限公司',
            'Code': '328'
        }]
    },
    {
        'Name': '锡林浩特市',
        'Code': '6269',
        'Dealer': [{
            'Name': '锡林浩特市华菱丰汽车销售服务有限公司',
            'Code': '340'
        }]
    }]
},
{
    'Name': '宁夏',
    'Code': '47',
    'City': [{
        'Name': '银川市 ',
        'Code': '104',
        'Dealer': [{
            'Name': '宁夏和众进口汽车销售服务有限公司',
            'Code': '69'
        },
        {
            'Name': '大众进口汽车尊享荟（银川）',
            'Code': '295'
        }]
    }]
},
{
    'Name': '青海',
    'Code': '48',
    'City': [{
        'Name': '西宁市 ',
        'Code': '119',
        'Dealer': [{
            'Name': '青海嘉信汽车销售服务有限公司',
            'Code': '100'
        }]
    }]
}]